Revit 2026 API

# DatumPlanePropagateToViews Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void PropagateToViews(
	View view,
	ISet<ElementId> parallelViews
)
```
```vb
Public Sub PropagateToViews (
	view As View,
	parallelViews As ISet(Of ElementId)
)
```
```cpp
public:
void PropagateToViews(
	View^ view,
	ISet<ElementId^>^ parallelViews
)
```
```fsharp
member PropagateToViews :
        view : View *
        parallelViews : ISet<ElementId> -> unit
```

#### Parameters

view View

parallelViews ISetElementId

#### Reference

DatumPlane Class

Autodesk.Revit.DB Namespace